{"661":"34","666":"39","1497":"© ","177500":"2024","208744":"EMEA","295600":"XXXX","11531703":"Founded Peek Publishing on the back of our first newsletter - Tech Peek. Started reaching decision makers in the technology and financial industries.","21730162":"View Publications","23391766":"Tap into our 15+ years of experience in crafting and executing successful content marketing programs for some of the world’s leading brands.","66275133":"Asia Pacific","69256381":"Access to an editorial calendar","25695b":"PEEK","-70a77609":"PUBLISHERS","-7804285f":"Log in","4183f7e7":"Publications","3c2336d":"About","-176680fc":"Advertising","-64104400":"Contact","-72c4e940":"Subscribe Now","-43af449d":"See the publications","6493c9a4":"Business insights for industry leaders","-2c91c3c6":"Daily industry analysis bringing you the news and insights that matter.","738b12fc":"industries","35abba62":"Super. Simple. Insights.","-4bf26aec":"The insights you need. Daily.","-5341d315":"Our publications help business leaders stay on top of the biggest stories and trends in their industry.","-7c9dce56":" Peek Publishers. All rights reserved.","4cf5967":"Terms","5079bb68":"Privacy","-64062591":"Cookies","-56f05897":"Read by business leaders","-69de02d6":"Subscribe","7635fb4f":"This is some text inside of a div block.","3d503d2b":"No items found.","-4c765f31":"Grow with Peek Publishers","-793a8b3c":"Your Brand Story Told","6b78986b":"We collaborate with industry leaders to find their ideal customer and drive demand","-364d0a89":"Get Started","6af5503c":"Brand awareness","6f4e1c06":"Reach your marketing goals","-7ed56017":"Increase brand awareness, boost engagement, and enhance lead quality with the expertise of our marketing, SEO, lead generation, and distribution specialists. Leverage our audience for valuable first-party insights to inform and refine your strategy.","-1d988fe4":"Brand Awareness","-453a9c15":"Elevate brand awareness through native advertising by connecting with your audience on their trusted news platforms. Strengthen your brand by aligning with the sources they rely on.","659bac35":"Brand Storytelling","-3f288094":"Thought Leadership","-36e74e49":"Our content studio creates original, journalistic stories with unique perspectives, in-depth insights, and expert research.","504f045c":"Lead Generation","66e5a9bf":"Expand your content’s impact through our distribution network, reaching over 1 million key decision-makers across 39 industries.","-850a700":"Get started with a campaign","-26744920":"We can't wait to hear more about your goals.","69c1a21b":"First name","-1407da4b":"Last name","-1d98d4c4":"Business Email","-64202ba3":"Company","61f97ff5":"Job Title","-56aae44d":"Phone (optional)","-6e52ecec":"Region","57f3b1cc":"Select one...","-7a40d4cc":"The Americas","46a0e44a":"What is your primary marketing interest?","3ad99044":"Advertising to reach the peek audience","-218c42c0":"Branded content creation","-119bbfea":"PR assistance","48f8ef0":"Other","483d5851":"You agree to our friendly ","329660ca":"privacy policy","2e":".","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","-53f399f2":"Get in Touch","53ed4061":"Questions? Let us know how we can help.","7f274abe":"Contact us","669809e7":"If you're interested in advertising please contact us on our ","-7e7badf5":"advertising page","-346bea29":". For anything else please let us know how we can help.","24eeab":"Name","3ff5b7c":"Email","-63dc6819":"Message","848a01e":"Built to inform. ","-222b0388":"Peek Publishers was created to provide the daily analysis you need on the news that matters for your industry.","645efc51":"About Us","2adc85bd":"The news you need. Summarized, analyzed and delivered.","-17362332":"We keep tabs on the news that matters to you and then send you a daily summary that contains analysis and synthesis. We connect the dots on the topics that matter to you.","-77ecc79f":"Timeline","5ae24c95":"Where we've been and where are we going.","1774fd":"2021","2202dad7":"Andrew Speer set up Two Cores - a development and automation agency. Startded building custom automations and business intelligence reports for clients.","1774fe":"2022","1774ff":"2023","6f07185b":"Launched five new publications including daily briefings for CTOs, CFOs and CIOs. Launched Peek Studio to help brands develop effective communication and marketing to reach their target clients.","71c8706":"Launched 30+ new publications taking total publications to 40 across industries and sectors."}